## Görev 1:

#### Veri Hazırlama işlemlerini gerçekleştiriniz.

In [1]:
import pandas as pd
pd.set_option('display.max_columns', 20)

In [2]:
movie = pd.read_csv(r'C:/Users/eyp_d/Desktop/VBO-Bootcamp-Dersler/4.Hafta/Ders Öncesi Notlar/movie_lens_dataset/movie.csv')
rating = pd.read_csv('C:/Users/eyp_d/Desktop/VBO-Bootcamp-Dersler/4.Hafta/Ders Öncesi Notlar/movie_lens_dataset/rating.csv')

In [3]:
movie.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [4]:
rating.head()

   userId  movieId  rating            timestamp
0       1        2     3.5  2005-04-02 23:53:47
1       1       29     3.5  2005-04-02 23:31:16
2       1       32     3.5  2005-04-02 23:33:39
3       1       47     3.5  2005-04-02 23:32:07
4       1       50     3.5  2005-04-02 23:29:40

In [5]:
df = movie.merge(rating, how="left", on="movieId")

In [6]:
df.head()

,movieId,title,genres,userId,rating,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,3.0,4.0,1999-12-11 13:36:47
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,6.0,5.0,1997-03-13 17:50:52
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,8.0,4.0,1996-06-05 13:37:51
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,10.0,4.0,1999-11-25 02:44:47
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,11.0,4.5,2009-01-02 01:13:41

In [7]:
comment_counts = pd.DataFrame(df["title"].value_counts())

In [8]:
comment_counts.head()

                                  title
Pulp Fiction (1994)               67310
Forrest Gump (1994)               66172
Shawshank Redemption, The (1994)  63366
Silence of the Lambs, The (1991)  63299
Jurassic Park (1993)              59715

In [9]:
rare_movies = comment_counts[comment_counts["title"] <= 1000].index

In [10]:
common_movies = df[~df["title"].isin(rare_movies)] # Az yorumlanmış filmlerin çıkarılmış durumdaki hali.

In [11]:
common_movies.head()

,movieId,title,genres,userId,rating,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,3.0,4.0,1999-12-11 13:36:47
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,6.0,5.0,1997-03-13 17:50:52
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,8.0,4.0,1996-06-05 13:37:51
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,10.0,4.0,1999-11-25 02:44:47
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,11.0,4.5,2009-01-02 01:13:41

In [12]:
user_movie_df = common_movies.pivot_table(index=["userId"], columns=["title"], values="rating")

In [13]:
user_movie_df.head()

title,"'burbs, The (1989)",(500) Days of Summer (2009),*batteries not included (1987),...And Justice for All (1979),10 Things I Hate About You (1999),"10,000 BC (2008)",101 Dalmatians (1996),101 Dalmatians (One Hundred and One Dalmatians) (1961),102 Dalmatians (2000),12 Angry Men (1957),...,Zero Dark Thirty (2012),Zero Effect (1998),Zodiac (2007),Zombieland (2009),Zoolander (2001),Zulu (1964),[REC] (2007),eXistenZ (1999),xXx (2002),¡Three Amigos! (1986)
userId,,,,,,,,,,,,,,,,,,,,,
1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## Görev 2:

#### Öneri yapılacak kullanıcının izlediği filmleri belirleyiniz.

In [16]:
pd.set_option('display.max_columns', 5)
random_user = int(pd.Series(user_movie_df.index).sample(1, random_state=45).values)

In [122]:
random_user

28941

In [17]:
random_user_df = user_movie_df[user_movie_df.index == random_user]

In [18]:
random_user_df.head()

title,"'burbs, The (1989)",(500) Days of Summer (2009),...,xXx (2002),¡Three Amigos! (1986)
userId,,,,,
28941.0,NaN,NaN,...,NaN,NaN

In [19]:
movies_watched = random_user_df.columns[random_user_df.notna().any()].tolist()

In [22]:
movies_watched # random seçilen kişinin, izlediği film listesi

['Ace Ventura: Pet Detective (1994)',
 'Ace Ventura: When Nature Calls (1995)',
 'Aladdin (1992)',
 'American President, The (1995)',
 'Apollo 13 (1995)',
 'Babe (1995)',
 'Bullets Over Broadway (1994)',
 'Clueless (1995)',
 'Disclosure (1994)',
 'Forrest Gump (1994)',
 'Four Weddings and a Funeral (1994)',
 'Home Alone (1990)',
 'Jurassic Park (1993)',
 'Like Water for Chocolate (Como agua para chocolate) (1992)',
 'Little Women (1994)',
 "Mr. Holland's Opus (1995)",
 'Mrs. Doubtfire (1993)',
 'Much Ado About Nothing (1993)',
 "Muriel's Wedding (1994)",
 'Nine Months (1995)',
 'Operation Dumbo Drop (1995)',
 'Piano, The (1993)',
 'Postman, The (Postino, Il) (1994)',
 'Ready to Wear (Pret-A-Porter) (1994)',
 'Remains of the Day, The (1993)',
 'Sabrina (1995)',
 "Schindler's List (1993)",
 'Secret Garden, The (1993)',
 'Sense and Sensibility (1995)',
 'Shadowlands (1993)',
 'Silence of the Lambs, The (1991)',
 'Star Trek: Generations (1994)',
 'Stargate (1994)']

## Görev 3:

#### Aynı filmleri izleyen diğer kullanıcıların verisine ve Id'lerine erişiniz.

In [23]:
movies_watched_df = user_movie_df[movies_watched]

In [24]:
movies_watched_df.head()

title,Ace Ventura: Pet Detective (1994),Ace Ventura: When Nature Calls (1995),...,Star Trek: Generations (1994),Stargate (1994)
userId,,,,,
1.0,NaN,NaN,...,NaN,NaN
2.0,NaN,NaN,...,NaN,NaN
3.0,NaN,NaN,...,5.0,5.0
4.0,NaN,3.0,...,3.0,NaN
5.0,NaN,NaN,...,NaN,4.0

In [25]:
user_movie_count = movies_watched_df.T.notnull().sum()

In [26]:
user_movie_count

userId
1.0          1
2.0          2
3.0          4
4.0          6
5.0         11
            ..
138489.0     1
138490.0     7
138491.0     0
138492.0     2
138493.0     9
Length: 138493, dtype: int64

In [27]:
user_movie_count = user_movie_count.reset_index()

In [30]:
user_movie_count.head()

   userId   0
0     1.0   1
1     2.0   2
2     3.0   4
3     4.0   6
4     5.0  11

In [31]:
user_movie_count.columns = ["userId", "movie_count"]

In [32]:
user_movie_count.head()

   userId  movie_count
0     1.0            1
1     2.0            2
2     3.0            4
3     4.0            6
4     5.0           11

In [39]:
users_same_movies = user_movie_count[user_movie_count["movie_count"] > 25]["userId"] # 20'den fazla aynı filmi izleyen kullanıcı id'leri

In [40]:
users_same_movies.head()

774      775.0
902      903.0
981      982.0
1104    1105.0
1616    1617.0
Name: userId, dtype: float64

In [41]:
users_same_movies.count()

682

## Görev 4:

#### Öneri yapılacak kullanıcı ile en benzer kullanıcıları belirleyiniz.

In [42]:
final_df = pd.concat([movies_watched_df[movies_watched_df.index.isin(users_same_movies)],
                      random_user_df[movies_watched]])

In [43]:
final_df.head()

title,Ace Ventura: Pet Detective (1994),Ace Ventura: When Nature Calls (1995),...,Star Trek: Generations (1994),Stargate (1994)
userId,,,,,
775.0,2.5,1.5,...,3.5,2.5
903.0,2.0,1.0,...,2.0,3.0
982.0,3.5,3.0,...,2.5,3.0
1105.0,3.0,1.0,...,3.0,3.0
1617.0,2.0,NaN,...,3.0,3.0

In [44]:
corr_df = final_df.T.corr().unstack().sort_values().drop_duplicates()
corr_df.head()

userId    userId
103594.0  43700.0   -0.778267
11943.0   54459.0   -0.744263
27463.0   67756.0   -0.740480
111549.0  54188.0   -0.731474
65832.0   75678.0   -0.716591
dtype: float64

In [47]:
corr_df = pd.DataFrame(corr_df, columns=["corr"])
corr_df.index.names = ['user_id_1', 'user_id_2']
corr_df = corr_df.reset_index()

In [48]:
corr_df.head()

   user_id_1  user_id_2      corr
0   103594.0    43700.0 -0.778267
1    11943.0    54459.0 -0.744263
2    27463.0    67756.0 -0.740480
3   111549.0    54188.0 -0.731474
4    65832.0    75678.0 -0.716591

In [49]:
top_users = corr_df[(corr_df["user_id_1"] == random_user) & (corr_df["corr"] >= 0.65)][
    ["user_id_2", "corr"]].reset_index(drop=True)

In [55]:
top_users = top_users.sort_values(by='corr', ascending=False)
top_users.rename(columns={"user_id_2": "userId"}, inplace=True)

In [56]:
top_users.head()

    userId      corr
5  28941.0  1.000000
4   9783.0  0.747942
3  67346.0  0.732943
2  67346.0  0.732943
1  61709.0  0.665115

In [57]:
top_users_ratings = top_users.merge(rating[["userId", "movieId", "rating"]], how='inner')

In [58]:
top_users_ratings.head()

    userId  corr  movieId  rating
0  28941.0   1.0        7     5.0
1  28941.0   1.0       11     3.0
2  28941.0   1.0       17     5.0
3  28941.0   1.0       19     2.0
4  28941.0   1.0       34     5.0

In [60]:
top_users_ratings = top_users.merge(rating[["userId", "movieId", "rating"]], how='inner')

In [61]:
top_users_ratings.head()

    userId  corr  movieId  rating
0  28941.0   1.0        7     5.0
1  28941.0   1.0       11     3.0
2  28941.0   1.0       17     5.0
3  28941.0   1.0       19     2.0
4  28941.0   1.0       34     5.0

In [62]:
top_users_ratings = top_users_ratings[top_users_ratings["userId"] != random_user] # kullanıcının kendisi çıkarılıyor.

In [64]:
top_users_ratings.head()

    userId      corr  movieId  rating
33  9783.0  0.747942        2     1.0
34  9783.0  0.747942        6     2.0
35  9783.0  0.747942       10     3.0
36  9783.0  0.747942       11     2.0
37  9783.0  0.747942       16     3.0

## Görev 5:

#### Weighted Average Recommendation Score'u hesaplayınız ve ilk 5 filmi tutunuz.

In [65]:
top_users_ratings['weighted_rating'] = top_users_ratings['corr'] * top_users_ratings['rating']
top_users_ratings.head()

    userId      corr  movieId  rating  weighted_rating
33  9783.0  0.747942        2     1.0         0.747942
34  9783.0  0.747942        6     2.0         1.495885
35  9783.0  0.747942       10     3.0         2.243827
36  9783.0  0.747942       11     2.0         1.495885
37  9783.0  0.747942       16     3.0         2.243827

In [66]:
top_users_ratings.groupby('movieId').agg({"weighted_rating": "mean"})

         weighted_rating
movieId
1               2.645071
2               1.796120
3               1.398058
4               2.352706
5               1.832357
...                  ...
56367           2.565300
56508           2.931772
56788           2.565300
58303           2.931772
59725           2.931772

[3240 rows x 1 columns]

In [70]:
recommendation_df = top_users_ratings.groupby('movieId').agg({"weighted_rating": "mean"})

In [71]:
recommendation_df = recommendation_df.reset_index()

In [72]:
recommendation_df.head()

   movieId  weighted_rating
0        1         2.645071
1        2         1.796120
2        3         1.398058
3        4         2.352706
4        5         1.832357

In [74]:
recommendation_df[["movieId"]].nunique()

movieId    3240
dtype: int64

In [75]:
movies_to_be_recommend = recommendation_df[recommendation_df["weighted_rating"] > 3.6].sort_values("weighted_rating", ascending=False)

In [76]:
movies_to_be_recommend.head()

      movieId  weighted_rating
52         82         3.664714
416       858         3.664714
1451     3194         3.664714
1547     3451         3.664714
1775     4062         3.664714

In [79]:
movie = pd.read_csv(r'C:/Users/eyp_d/Desktop/VBO-Bootcamp-Dersler/4.Hafta/Ders Öncesi Notlar/movie_lens_dataset/movie.csv')
movies_to_be_recommend.merge(movie[["movieId", "title"]]).head()

   movieId  weighted_rating                                title
0       82         3.664714      Antonia's Line (Antonia) (1995)
1      858         3.664714                Godfather, The (1972)
2     3194         3.664714              Way We Were, The (1973)
3     3451         3.664714  Guess Who's Coming to Dinner (1967)
4     4062         3.664714                  Mystic Pizza (1988)

## Görev 6:

#### Kullanıcının izlediği filmlerden en son en yüksek puan verdiği filmin adına göre user-basede ve item-based öneri yapınız.

In [112]:
movies_to_be_recommend = recommendation_df[recommendation_df["weighted_rating"] > 3.5].sort_values("weighted_rating", ascending=False)

In [113]:
movies_to_be_recommend.head()

      movieId  weighted_rating
52         82         3.664714
1395     3068         3.664714
1451     3194         3.664714
1547     3451         3.664714
1775     4062         3.664714

In [114]:
movies_to_be_recommend = movies_to_be_recommend.merge(movie[["movieId", "title"]])

In [115]:
movies_to_be_recommend["title"].head()

0        Antonia's Line (Antonia) (1995)
1                    Verdict, The (1982)
2                Way We Were, The (1973)
3    Guess Who's Coming to Dinner (1967)
4                    Mystic Pizza (1988)
Name: title, dtype: object

In [119]:
movie = pd.read_csv(r'C:/Users/eyp_d/Desktop/VBO-Bootcamp-Dersler/4.Hafta/Ders Öncesi Notlar/movie_lens_dataset/movie.csv')
rating = pd.read_csv('C:/Users/eyp_d/Desktop/VBO-Bootcamp-Dersler/4.Hafta/Ders Öncesi Notlar/movie_lens_dataset/rating.csv')

In [190]:
movie_id = rating[(rating["userId"] == random_user) & (rating["rating"] == 5)].sort_values(by="timestamp", ascending=False)["movieId"][0:1].values[0]

In [191]:
movie_id

7

In [215]:
movie_name = movie[movie["movieId"] == movie_id]["title"].values[0]

In [216]:
movie_name

'Sabrina (1995)'

In [217]:
movie_name = user_movie_df[movie_name]
movies_from_item_based = user_movie_df.corrwith(movie_name).sort_values(ascending=False).head(10)

In [218]:
movies_from_item_based[1:6].index

Index(['Intouchables (2011)', 'Father of the Bride (1991)',
       'Anna and the King (1999)', 'Runaway Bride (1999)',
       'Phantom of the Opera, The (2004)'],
      dtype='object', name='title')